# Project Overview

## Libraries

In [2]:
import pandas as pd
import numpy as np

## Import Data

In [6]:
df = pd.read_csv(r'C:\Users\efrui\DataspellProjects\Sentiment\data\raw\loan_data.csv')

In [7]:
df.head()

,Text,Income,Credit_Score,Loan_Amount,DTI_Ratio,Employment_Status,Approval
0,I need a loan to pay for an international vaca...,26556,581,8314,79.26,employed,Rejected
1,I want to make home improvements like installi...,197392,389,111604,22.14,employed,Rejected
2,"I need a loan for home renovation, including a...",44561,523,34118,45.44,employed,Rejected
3,I need funds to buy new furniture and applianc...,190363,729,118757,10.22,unemployed,Rejected
4,I need a loan to start a small business.,61853,732,19210,44.13,employed,Approved

### Explore Data

In [10]:
df.isnull().sum()

Text                 0
Income               0
Credit_Score         0
Loan_Amount          0
DTI_Ratio            0
Employment_Status    0
Approval             0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Text               24000 non-null  object
 1   Income             24000 non-null  int64
 2   Credit_Score       24000 non-null  int64
 3   Loan_Amount        24000 non-null  int64
 4   DTI_Ratio          24000 non-null  float64
 5   Employment_Status  24000 non-null  object
 6   Approval           24000 non-null  object
dtypes: float64(1), int64(3), object(3)
memory usage: 1.3+ MB

In [8]:
df.describe()

              Income  Credit_Score    Loan_Amount     DTI_Ratio
count   24000.000000  24000.000000   24000.000000  24000.000000
mean   110377.552708    575.720333   44356.154833     34.719167
std     51729.677627    159.227621   34666.604785     32.322471
min     20001.000000    300.000000    1005.000000      2.530000
25%     65635.750000    437.000000   16212.000000     14.507500
50%    110464.000000    575.000000   35207.000000     24.860000
75%    155187.000000    715.000000   65622.750000     41.840000
max    200000.000000    850.000000  158834.000000    246.330000

In [12]:
# Preview the text  column
df['Text'].sample(10)

18658    I need a loan to support my side business sell...
1798     I need a loan to pay for my son's medical trea...
7838     I need financial support to renovate my rental...
6556     I need funds to pay for my pilot training prog...
23165    I want to start a small roadside food stall an...
11747    I want to start a local transportation service...
7684     I need a loan to cover emergency expenses afte...
303      I want to purchase land to start an organic fa...
3367     I need a loan to cover emergency expenses afte...
9374     I need financial help to install a swimming po...
Name: Text, dtype: object

In [13]:
# Check length of TExt
df['text_length'] = df['Text'].astype(str).apply(len)
df['text_length'].describe()

count    24000.000000
mean        63.313167
std          8.202554
min         40.000000
25%         57.000000
50%         64.000000
75%         69.000000
max         82.000000
Name: text_length, dtype: float64

In [14]:
# Drop duplicate
df = df.drop_duplicates()

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24000 entries, 0 to 23999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Text               24000 non-null  object
 1   Income             24000 non-null  int64
 2   Credit_Score       24000 non-null  int64
 3   Loan_Amount        24000 non-null  int64
 4   DTI_Ratio          24000 non-null  float64
 5   Employment_Status  24000 non-null  object
 6   Approval           24000 non-null  object
 7   text_length        24000 non-null  int64
dtypes: float64(1), int64(4), object(3)
memory usage: 1.5+ MB

Insight:

No missing data,No duplicates, the text data looks clean with no unusual formating. has an average text length of 63 alphabets

Dataset comprises of 3 categorical columns and 4 numerical column. I am dealing with 2400 records.

some of the  categorical columns will go through simple label encoding, they obviously have no order. Next text labeling.

## Export Cleaned Data

In [17]:
# Save as a new processed file
df.to_csv(r'C:\Users\efrui\DataspellProjects\Sentiment\data\cleaned\clean_loan_data.csv', index=False)